[
  {
    "id": "1",
    "program": "University of British Columbia",
    "dates": "Sep. 2016 - May 2020",
    "description": "I graduated a holding a Degree with Honours distinction in Marketing from the University of British Columbia's Sauder School of Business, where I completed the Bachelor of Commerce program. In my senior year, I took two capstone courses: New Venture Design and General Leadership & Management.<br/><br/>In the https://mybcom.sauder.ubc.ca/courses-money-enrolment/courses/comm-466 course, I collaborated with three engineers and two commerce students over an 8-month period to research, design, and prototype a feasible venture. Our idea attracted interest from Ferrari racecar drivers who wanted to test it out, but unfortauntely stabilizing an image at 200 miles/hour is difficult.<br/><br/>The https://mybcom.sauder.ubc.ca/courses-money-enrolment/courses/comm-483 course was an intensive program with over 120 hours of in-class instruction on weekends during my last semester. Throughout the course, I completed over 40 case studies, read 6 books, and had a number of interesting class discussions on leadership and current events.<br/><br/>While at UBC, I focused on marketing for my core courses, but my electives were all dedicated to mathematics and statistics, which included advanced coursework in applied linear algebra, linear programming, multivariable calculus, and probability thoery. <br/><br/>I served as the Indigenous Student ambassador, leading campus tours for indigenous youth groups from across Canada. This experience led to my position as the senior peer leader for Destination UBC, where I organized and planned a weekend program for top indigenous students from across Canada to learn about the university. Furthermore, I worked for Dr. Darren Dahl as a teaching assistant for his MBA course on Creativity and as one of his research assistants in the Marketing and Behavioural Science Lab. In this role, I conducted focus groups, interviews, experiments, and data collection.<br/><br/>In my last year at UBC, I was honored with an invitation to attend the 16th annual student leadership conference as a delegate."
  },
  {
    "id": "2",
    "program": "BrainStation Web Development Bootcamp",
    "dates": "Nov.2022 - Feb. 2023",
    "description": "I broadened my skill set by enrolling in the https://brainstation.io/course/online/remote-web-development-bootcamp 12-week Web Development Bootcamp. During the program, I completed over four full-stack applications, including a collaborative project, and participated in three hackathons.<br/><br/>The bootcamp was structured into several units, each focusing on different aspects of web development. This began with an introduction to the fundamentals of web development, covering tools such as HTML, CSS, and JavaScript. Then progressed into front-end development frameworks like React. Which then lead us to focus on the back-end, where I learned to work with server-side technologies like Node.js, Express, MySQL, and Knex.js. This knowledge allowed me to create and manage databases, handle user authentication, and implement API integrations.<br/><br/>For my final project, I built an application I called https://github.com/larocquedylan/beats-for-bits-api, which was an experiment in tinkering with Bitcoin, more specifically, the Lightning Network. Here, I implemented streams on my server and used the LNBits api to create an application that allows users to send value over the internet in exchange for my beats, with no fees, no information needed from them, and instant final settlement of transactions."
  },
  {
    "id": "3",
    "program": "EpicReact.dev",
    "dates": "April 2023",
    "description": "After completing the Bootcamp, I decided to further deepen my knowledge of React by enrolling in https://epicreact.dev, an online workshop designed by Kent C. Dodds that focuses on React and its ecosystem.<br/><br/>The workshop started with the fundamentals, which covered essential concepts such as components, state management, and props. Then dove deeper into advanced React hooks such as useReducer, useContext, useCallback, useLayout, useDebugValue, useLayoutEffect, and creating custom hooks. From there, we got into advanced React patterns like compound components, context, render props, and prop collection and getters. The course also emphasizes performance optimization, teaching techniques such as memoization, lazy loading, and code splitting. Moreover, it introduced me to testing using tools and libraries like Jest and React Testing Library. The final module of EpicReact explores server-side rendering, data fetching, and React Suspense. It also covers best practices in organizing code, managing application state using libraries like Redux, and implementing design systems for a consistent user interface. The workshop culminates in a final project that covers stuff like authentication, cache manegment, context, and E2E testing.<br/><br/>I am currently working on this project. I hope to integrate the midjourney API and allow users to save favourite quotes from their books which then serve as prompts for the API to generate images."
  }
]
